# Напишете скрипт, който цензурира всички срещания на “забранени” думи в дадени текстове.
# Примерно извикване: ./redact.sh bad_words.lst ./my_texts.
# Първият аргумент на скрипта е име на текстов файл, съдържащ по една забранена дума на ред:
# cake
# cakes
# shake
# banana
# pine_apple42
# shakinator
# Вторият аргумент е име на директория: интересуват ни всички файлове в нея и в нейните поддиректории, чиито имена завършват на .txt.
# Скриптът ви трябва да подмени всички срещания на забранени думи във въпросните файлове с
# брой звездички, съответстващ на дължината на думата. Подменят се само цели срещания на думи.
# Например, ако имаме файл ./my_texts/shake.txt със съдържание:
# to make banana shake, we start by blending four bananas.
# след изпълнение на скрипта, съдържанието му трябва да е:
# to make ****** *****, we start by blending four bananas.
# Под “дума” разбираме последователност от букви, цифри и долни черти.
# За улеснение, може да приемете, че разглеждаме само малки букви (никъде не се срещат главни
# букви).
# За бонус точки: премахнете улесненито, правейки операцията по цензуриране case-insensitive
# (файлът със забранени думи пак съдържа само малки букви, но в текстовете могат да се срещнат варианти на думите с 
# произволни комбинации от малки и главни букви): ако в примерния текст се срещне думата BaNaNa, тя трябва 
# да бъде заменена с ******, защото banana е забранена дума.

#!/bin/bash

if [ "$#" -ne 2 ]; then
	echo "Wrong number of arguments."
	exit 99
fi

if [ ! -f "$1" ]; then
	echo "Provide a file as a first argument."
	exit 98
fi

if [ ! -d "$2" ]; then
	echo "Provide a directory as a second argument."
	exit 97
fi

function cr_w {
	len=${#1}
 	n_word=""
 	
	for (( i=0; i < $len; i++ )); do
		n_word+='*'
	done

	echo "$n_word"
}

while read -r f_word; do
	n_word=$(cr_w "$f_word")
	while read -r fl; do
		sed -i "s/\b$f_word/$n_word/gI" "$fl"
	done < <(find "./$2" -type f -name "*.txt")
done < "$1"

