# При статистическа обработка на текстове често се налага да имаме списък от думи (наречени
# “стоп-думи”), които се срещат прекалено често и не носят стойност за изследването. Такива думи
# са например “you”, “then”, “for” и т.н.
# Напишете скрипт stopword_candidates.sh, който приема като аргумент име на директория и извежда 10-те думи, които най-много изглеждат като стоп-думи.
# • За да бъде стоп-дума, трябва броят файлове, които я съдържат ≥ 3 пъти да е ≥
# общия брой файлове
# 2
# • Една дума е по-добър кандидат от друга, ако има по-голям общ брой срещания във всички
# файлове
# Забележки:
# • Под “всички файлове” имаме предвид всички обикновени файлове в дадената директория и
# нейните поддиректории
# • Под “дума” имаме предвид непрекъсната последователност от латински букви (a-z) - всички
# останали символи не са част от думите
# • За улеснение може да приемете, че във файловете няма главни букви

#!/bin/bash

if [[ ! $# -eq 1 ]]; then
	echo "should be 1 arg"
	exit 99
fi

if [[ ! -d $1 ]]; then
 	echo "should be dir"
 	exit 98
fi

c_f=$(find "$1" -type f | wc -l)
while read c w; do
	if [[ $c -ge $c_f ]]; then 
		n_f=$(grep -rl "$w" "$1" | sort | uniq | wc -l)
		if [[ $n_f -ge 3  ]]; then
			echo $w
		fi
	fi
done < <(grep -ro -E '[a-zA-Z]+' "$1" --no-filename | tr 'A-Z' 'a-z' | sort | uniq -c | sort -nr) | head 
